Client/Client/web_messages.svclog

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2015-09-21T13:37:16.5551185Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{2388ad17-ca93-47fe-964e-358fa8eac304}" /><Execution ProcessName="iisexpress" ProcessID="4724" ThreadID="7" /><Channel/><Computer>HYD-DEHARISH-L</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2015-09-21T19:07:16.5511181+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:5060/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo1W3598ywrpOjAWQs8t8CYUAAAAAIfNe+drd4EGEkUx8Jhs++GzCkgnpJMdFs6tL1kmWsqUACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="ef6ebf45-c4ae-462f-850c-3087594a129b" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">2388ad17-ca93-47fe-964e-358fa8eac304</ActivityId></s:Header><s:Body><GetEmployee xmlns="http://tempuri.org/"><Id>1</Id></GetEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2015-09-21T13:37:16.8111441Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{2388ad17-ca93-47fe-964e-358fa8eac304}" /><Execution ProcessName="iisexpress" ProcessID="4724" ThreadID="7" /><Channel/><Computer>HYD-DEHARISH-L</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2015-09-21T19:07:16.8101440+05:30" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>570</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Mon, 21 Sep 2015 13:37:16 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><GetEmployeeResponse xmlns="http://tempuri.org/"><GetEmployeeResult i:type="b:FullTimeEmployee" xmlns:a="http://shwetatech.com/2015/" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:b="http://schemas.datacontract.org/2004/07/EmployeeService"><a:Id>1</a:Id><a:Name>Shweta</a:Name><a:Gender>Female</a:Gender><a:DateOfBirth>1989-10-10T00:00:00</a:DateOfBirth><a:Type>FullTimeEmployee</a:Type><b:AnnualSalary>11</b:AnnualSalary></GetEmployeeResult></GetEmployeeResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2015-09-21T13:37:45.4236205Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{3edf2a4f-1bc4-48d4-8f47-5c38bf3d0557}" /><Execution ProcessName="iisexpress" ProcessID="4724" ThreadID="9" /><Channel/><Computer>HYD-DEHARISH-L</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2015-09-21T19:07:45.4236205+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/SaveEmployee</Action><To>http://localhost:5060/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo1a3598ywrpOjAWQs8t8CYUAAAAAIfNe+drd4EGEkUx8Jhs++GzCkgnpJMdFs6tL1kmWsqUACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="5dbfdae4-cac4-417b-82d2-eaf0aee3262b" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">3edf2a4f-1bc4-48d4-8f47-5c38bf3d0557</ActivityId></s:Header><s:Body><SaveEmployee xmlns="http://tempuri.org/"><Employee i:type="b:FullTimeEmployee" xmlns:a="http://shwetatech.com/2015/" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:b="http://schemas.datacontract.org/2004/07/EmployeeService"><a:Id>4</a:Id><a:Name>Tony</a:Name><a:Gender>Male</a:Gender><a:DateOfBirth>1991-10-25T00:00:00</a:DateOfBirth><a:Type>FullTimeEmployee</a:Type><b:AnnualSalary>20000</b:AnnualSalary></Employee></SaveEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2015-09-21T13:37:45.4236205Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{3edf2a4f-1bc4-48d4-8f47-5c38bf3d0557}" /><Execution ProcessName="iisexpress" ProcessID="4724" ThreadID="9" /><Channel/><Computer>HYD-DEHARISH-L</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2015-09-21T19:07:45.4236205+05:30" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>145</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Mon, 21 Sep 2015 13:37:45 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><SaveEmployeeResponse xmlns="http://tempuri.org/"></SaveEmployeeResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2015-09-21T13:37:47.2400931Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{800cbfe4-f531-4068-bc04-0c90522099e3}" /><Execution ProcessName="iisexpress" ProcessID="4724" ThreadID="13" /><Channel/><Computer>HYD-DEHARISH-L</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2015-09-21T19:07:47.2400931+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:5060/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo1e3598ywrpOjAWQs8t8CYUAAAAAIfNe+drd4EGEkUx8Jhs++GzCkgnpJMdFs6tL1kmWsqUACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="c497f904-30e0-43ab-84ba-28d227b92c6b" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">800cbfe4-f531-4068-bc04-0c90522099e3</ActivityId></s:Header><s:Body><GetEmployee xmlns="http://tempuri.org/"><Id>4</Id></GetEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2015-09-21T13:37:47.2400931Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{800cbfe4-f531-4068-bc04-0c90522099e3}" /><Execution ProcessName="iisexpress" ProcessID="4724" ThreadID="13" /><Channel/><Computer>HYD-DEHARISH-L</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2015-09-21T19:07:47.2400931+05:30" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>569</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Mon, 21 Sep 2015 13:37:47 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><GetEmployeeResponse xmlns="http://tempuri.org/"><GetEmployeeResult i:type="b:FullTimeEmployee" xmlns:a="http://shwetatech.com/2015/" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:b="http://schemas.datacontract.org/2004/07/EmployeeService"><a:Id>4</a:Id><a:Name>Tony</a:Name><a:Gender>Male</a:Gender><a:DateOfBirth>1991-10-25T00:00:00</a:DateOfBirth><a:Type>FullTimeEmployee</a:Type><b:AnnualSalary>20000</b:AnnualSalary></GetEmployeeResult></GetEmployeeResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2015-09-21T13:39:55.7177117Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{6cc4dcfe-f590-4f31-9726-546bb52aeb64}" /><Execution ProcessName="iisexpress" ProcessID="4724" ThreadID="13" /><Channel/><Computer>HYD-DEHARISH-L</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2015-09-21T19:09:55.7177117+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/SaveEmployee</Action><To>http://localhost:5060/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo1i3598ywrpOjAWQs8t8CYUAAAAAIfNe+drd4EGEkUx8Jhs++GzCkgnpJMdFs6tL1kmWsqUACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="be44b5e0-0182-4f77-9f39-d189c1629132" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">6cc4dcfe-f590-4f31-9726-546bb52aeb64</ActivityId></s:Header><s:Body><SaveEmployee xmlns="http://tempuri.org/"><Employee i:type="b:FullTimeEmployee" xmlns:a="http://shwetatech.com/2015/" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:b="http://schemas.datacontract.org/2004/07/EmployeeService"><a:Id>4</a:Id><a:Name>Tony</a:Name><a:Gender>Male</a:Gender><a:DateOfBirth>1991-10-25T00:00:00</a:DateOfBirth><a:Type>FullTimeEmployee</a:Type><b:AnnualSalary>20000</b:AnnualSalary></Employee></SaveEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2015-09-21T13:40:06.8338232Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{d8198353-f057-4aef-b283-f35f571ca4b5}" /><Execution ProcessName="iisexpress" ProcessID="4724" ThreadID="18" /><Channel/><Computer>HYD-DEHARISH-L</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2015-09-21T19:10:06.8338232+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/SaveEmployee</Action><To>http://localhost:5060/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo1m3598ywrpOjAWQs8t8CYUAAAAAIfNe+drd4EGEkUx8Jhs++GzCkgnpJMdFs6tL1kmWsqUACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="182eab25-db3f-4edd-aa51-61a86be51119" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">d8198353-f057-4aef-b283-f35f571ca4b5</ActivityId></s:Header><s:Body><SaveEmployee xmlns="http://tempuri.org/"><Employee i:type="b:FullTimeEmployee" xmlns:a="http://shwetatech.com/2015/" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:b="http://schemas.datacontract.org/2004/07/EmployeeService"><a:Id>5</a:Id><a:Name>Tony</a:Name><a:Gender>Male</a:Gender><a:DateOfBirth>1991-10-25T00:00:00</a:DateOfBirth><a:Type>FullTimeEmployee</a:Type><b:AnnualSalary>20000</b:AnnualSalary></Employee></SaveEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent>